// Підключаємо технологію express для back-end сервера
const express = require("express");
// Cтворюємо роутер - місце, куди ми підключаємо ендпоїнти
const router = express.Router();

// ================================================================

class Purchase {}

// ================================================================

// router.get Створює нам один ентпоїнт

// ↙️ тут вводимо шлях (PATH) до сторінки
router.get("/", function (req, res) {
  // res.render генерує нам HTML сторінку

  // ↙️ cюди вводимо назву файлу з сontainer
  res.render("index", {
    // вказуємо назву папки контейнера, в якій знаходяться наші стилі
    style: "index",

    data: {},
  });
  // ↑↑ сюди вводимо JSON дані
});

// ================================================================

// Підключаємо роутер до бек-енду
module.exports = router;
